update flow chart
